package com.wycd.yushangpu.bean;

public enum SysSwitchType {
    T11(11),//商品消费
    T101(101),//现金支付
    T401(401),//商品简码
    T402(402),//会员价格
    T102(102),//余额支付
    T10(10),//快速消费
    T403(403),//商品品牌
    T26(26),//商品寄存
    T105(105),//微信记账
    T404(404),//规格型号
    T106(106),//支付宝记账
    T27(27),//商品领取
    T103(103),//银联支付
    T405(405),//参考进价
    T12(12),//计次消费
    T21(21),//计时消费
    T110(110),//优惠券
    T406(406),//初始库存
    T111(111),//扫码支付
    T18(18),//房台消费
    T407(407),//库存预警值
    T408(408),//排序编号
    T113(113),//其他支付
    T17(17),//限时消费
    T409(409),//保质期
    T107(107),//积分支付
    T13(13),//礼品兑换
    T451(451),//会员生日
    T109(109),//积分支付限制
    T1(1),//添加会员
    T602(602),//禁止0库存销售
    T108(108),//默认支付
    T2(2),//会员充值
    T452(452),//电子邮箱
    T305(305),//法定假日积分翻倍
    T201(201),//会员卡号同手机号
    T3(3),//会员充次
    T453(453),//身份证号
    T218(218),//禁止删除余额不为0的会员
    T213(213),//手机号可重复
    T454(454),//固定电话
    T7(7),//积分变动
    T6(6),//积分清零
    T803(803),//四舍五入到“元”
    T455(455),//推荐人
    T208(208),//会员卡卡面卡号
    T219(219),//自由充值
    T203(203),//初始金额和初始积分
    T456(456),//开卡人
    T8(8),//修改密码
    T209(209),//会员查询弹窗
    T220(220),//系统语音提醒
    T222(222),//微店自由充值
    T802(802),//四舍五入到“角”
    T221(221),//允许负库存
    T804(804),//直接舍弃“角”
    T457(457),//会员标签
    T9(9),//会员挂失
    T210(210),//是否显示它店会员
    T805(805),//直接舍弃“分”
    T4(4),//会员升级
    T458(458),//会员地址
    T211(211),//必填手机号
    T212(212),//计次消费规则
    T459(459),//备注信息
    T223(223),//消费后显示余额
    T5(5),//会员降级
    T22(22),//会员返利
    T214(214),//必须刷卡
    TypT(601),//商品数据修改
    T23(23),//获得优惠券
    T20(20),//优惠券发送
    T301(301),//员工提成
    T302(302),//员工提成按比例分成
    T16(16),//到期提醒
    T215(215),//撤单密码
    T14(14),//生日提醒
    T202(202),//开卡初始密码
    T303(303),//固定提成
    T204(204),//消费密码验证
    T24(24),//会员签到
    T205(205),//转账密码验证
    T217(217),//消费短信验证码验证
    T900(900),//修改单价
    T25(25),//一键加油
    T901(901),//修改折扣
    T206(206),//积分兑换密码验证
    T207(207),//换卡密码验证
    T902(902),//修改小计
    T903(903),//修改数量
    T503(503),//会员推荐提成
    T904(904),//员工提成
    T501(501),//会员消费提成
    T502(502),//会员获得积分提成
    T905(905),//挂单/取单
    T701(701),//开启客显
    T906(906),//挂账/结账
    T702(702),//通讯端口
    T907(907),//快捷充值
    T703(703),//波特率
    T908(908),//会员列表
    T801(801),//自由抹零
    T909(909),//交易记录
    T216(216);//自动匹配优惠活动

    private int value;

    SysSwitchType(int val) {
        this.value = val;
    }

    public int getValue() {
        return value;
    }

    public String getV() {
        return value + "";
    }
}
